[{"review_text": "An adorable romper! Belt and zipper were a little hard to navigate in a full day of wear/bathroom use, but that's to be expected. Wish it had pockets, but other than that-- absolutely perfect! I got a million compliments.", "review_summary": "So many compliments!", "review_date": "April 20, 2016", "id": 1},
{"review_text": "I rented this dress for a photo shoot. The theme was \"Hollywood Glam and Big Beautiful Hats\". The dress was very comfortable and easy to move around in. It is definitely on my list to rent again for another formal event. ", "review_summary": "I felt so glamourous!!!", "review_date": "June 18, 2013", "id": 2},
{"review_text": "I rented this for my company's black tie awards banquet.  I liked that this dress was short but was a little fancier with the sequins. (I generally don't care for long dresses.)  I would describe the color as more rose gold than yellow gold.  I have blonde hair and fair skin, and the color was very flattering.  This is a very forgiving dress! It's form fitting without making you feel like you're squeezed into it.  I would rent this one again.  Highly recommend!", "review_summary": "Dress arrived on time and in perfect condition. ", "review_date": "February 12, 2014", "id": 3},
{"review_text": "I have always been petite in my upper body and extremely athletic. \nI'm 5'9 and typically am a size 4,6,8 due to the fact I had a smaller upper frame and 34B cup. Depends what fabric were talking about too! \nHowever, because I have been lifting weights my back has grown (odd to add- but figured I'd say it knowing other people lift weights) My lat area is so wide that I was suffocating in a size 6. If I wasn't as muscular in my back I would've been fine. I would recommend to go up a size if you are into lifting weights and very broad in your upper body. ", "review_summary": "Was in love with this dress !!!", "review_date": "September 26, 2016", "id": 4},
{"review_text": "Didn't actually wear it. It fit perfectly. The fabric is a little thicker, so higher quality. Felt a bit too conservative for my taste. I rented it for the color and loved the berry shade of red.", "review_summary": "Traditional with a touch a sass", "review_date": "April 30, 2016", "id": 5},
{"review_text": "This dress is so sweet. I loved the print. The fit is loose with a tie for the waist, which means it should flatter most figures. Another win from Kate Spade!", "review_summary": "LITERALLY THE CUTEST DRESS EVER", "review_date": "December 7, 2017", "id": 6},
{"review_text": "Fit was great. Maybe a little tight under the arms. ", "review_summary": "Great dress, beautifully made.  I received lots of compliments!", "review_date": "January 1, 2013", "id": 7},
{"review_text": "The dress was very flattering and fit perfectly through my stomach and hips. I have a booty so I always worry about how things are going to fit, but this was amazing. I have a small chest and didn't fill out the built in bra as much as I would have liked, but it still looked great and I was comfortable in it. The dress had more stretch and give than I thought it would. I was worried I wouldn't be able to enjoy dancing and while I couldn't bust out break dance moves, I was able to dance without feeling completely restricted. I am always a zero in dresses and this fit true to size. I'm short, 5'3\" and I thought the length was perfect with a heel. Overall I'm very pleased with my order!! Thank you RTR!", "review_summary": "This dress was everything! It was perfect for the masquerade ball we attended!", "review_date": "October 17, 2016", "id": 8},
{"review_text": "The dress arrived with a small hole in the beading on the front but wasn't too noticeable. Glad I was able to get two sizes because the 4 was a little tight and would've made for an uncomfortable night of dancing! ", "review_summary": "It was fun to wear a dress I wouldn't normally buy! ", "review_date": "January 2, 2018", "id": 9},
{"review_text": "This dress was absolutely gorgeous and I received so many compliments!  I wore it to a black tie NYE wedding, and even though it was short, I felt like the fabric, fit, and the way it sparkled made it fit in just fine with the other formal gowns.  I usually wear a 6 or an 8 in dresses.  I ordered a 4 and a 6, and true to other reviewers' comments, the 4 fit me very well.  The chest area was just a tad loose, but that typically happens when I try on dresses...nothing a more padded bra couldn't fix!  The cut and fit were very figure flattering.  By the end of the evening I experience a little chafing under my arms from the sequins, but that was after 5 hours and it was very minor.  Thank you RTR for a great first experience, I'll definitely be back!", "review_summary": "Stunning dress, perfect for a New Year's Eve wedding!", "review_date": "January 7, 2013", "id": 10},
{"review_text": "The S was snug but in a good way. I wore a push up bra, but this dress made me look like a 34C! I wore spanx, too. Overall great dress! The only downside was that the sequins ripped up my bachelorette sash. There were strings everywhere but still felt like a million bucks. ", "review_summary": "This dress made me feel so confident & sexy! ", "review_date": "July 28, 2016", "id": 11},
{"review_text": "I ordered this dress as a replacement because I thought my original order would be too small.  This dress fit my abdomen well, but it hung slack around my shoulders and neck.  I wouldn't recommend a large size for apple body shapes; get the smaller size and let it hug you!", "review_summary": "Ordered this as a replacement dress", "review_date": "October 4, 2014", "id": 12},
{"review_text": "Fit great, super flattering", "review_summary": "Stunning gown. Wore this for heart ball and received compliments all night", "review_date": "May 29, 2014", "id": 13},
{"review_text": "Medium would have been a better fit but large worked for a night out.  Pants were high enough that they wouldve looked cute with a crop top too.  Very comfortable.  Would love to own a pair.", "review_summary": "These leggings are awesome!", "review_date": "May 16, 2016", "id": 14},
{"review_text": "This dress is just darling. I would absolutely wear it again. It fits true to size with a little room. I have larger hips and this dress fit fine and highlighted my smaller waist.  It isn't too tight around your middle and I was really comfortable in this one. I wore it out to dinner in Vegas and really felt amazing. ", "review_summary": "Really cute and comfortable.", "review_date": "March 28, 2017", "id": 15},
{"review_text": "I didn't end up wearing this even though it was great. It fit perfect other than in the upper body. If you have a tiny chest then it probably will show more of your skin versus looking flattering in the top. Everything else fit good, but I chose a different dress", "review_summary": "Didn't end up wearing. I would've chosen this, but the top was a little too open for me", "review_date": "October 8, 2017", "id": 1718},
{"review_text": "Really comfy and warm. Not itchy at all and I like my sweaters big for fall/winter. This was perfect for it!", "review_summary": "I just work it to work!", "review_date": "November 17, 2017", "id": 8632},
{"review_text": "Absolutely gorgeous dress. Great fit, no complaints! Lots of compliments.", "review_summary": "Beautiful!", "review_date": "April 20, 2016", "id": 12518},
{"review_text": "I wore an 8 since they didn't have a 6. Material was extremely stretchy so a 6 would've worked great. I got so many compliments and the dress was SO comfy!!!! I would highly recommend wearing this dress. It was a little long, but I held my dress up when I was dancing. ", "review_summary": "The pattern is amazing!!", "review_date": "November 1, 2016", "id": 22568},
{"review_text": "I really was not into this jumpsuit. It has a zipper in the front to customize cleavage levels, but given the crepe feel of the fabric, the overall look was like a wearing a onesie to bed. I did not wear this out, and just sent it back immediately.", "review_summary": "Looks and feels like cheap PJs", "review_date": "April 20, 2016", "id": 32354},
{"review_text": "Very comfy stretchy material. I would've gotten a 6 since it is a little bit big though. I have such broad shoulders I'm in between a 6 and 8 so it's tricky with sizes and material. If you are 140ish and extremely petite, I would recommend even a 4 since it stretches nice. Very awesome dress though! Loved it! ", "review_summary": "Loved the casual look", "review_date": "November 1, 2016", "id": 38407},
{"review_text": "  Initially ordered a M with my unlimited membership but returned for a S.  Runs big so size down.  Unfortunately the romper was delivered without the belt which took away from the outfit a little bit, but it still looked fine without the belt.  Got lots of compliments.  Very low cut but stays put. Definitely recommend and would rent it again!", "review_summary": "Loved the romper.", "review_date": "May 16, 2016", "id": 41405},
{"review_text": "perfect fit and very comfortable! ", "review_summary": "the colors", "review_date": "December 29, 2016", "id": 42720},
{"review_text": "SO many compliments. Glad I got the 6-- fit my height and my butt perfectly.", "review_summary": "LOVED this! ", "review_date": "August 16, 2016", "id": 46519},
{"review_text": "I could wear this literally forever. It is fairly low cut in the front, so for someone with a larger bust like mine, this would definitely be more of a brunch with friends kind of dress. I had intended to wear it to an Sunday alumni speaker event with a leather jacket, but I felt uncomfortable given its low cut. Wearing it out with girlfriends, however, was the perfect setting. ", "review_summary": "Gorgeous, low cut", "review_date": "June 15, 2016", "id": 53441},
{"review_text": "I've worn this dress twice because it is so cute. I love the look and the open back. ", "review_summary": "The back of this dress", "review_date": "July 28, 2014", "id": 59187},
{"review_text": "I wore this for a friends bach party since all the girls were asked to wear a little black dress.  I thought it was perfect.  I loved the way it fit--super flattering.  It was hott without being too much.  I recommend.", "review_summary": "great fitting dress", "review_date": "May 10, 2014", "id": 66628},
{"review_text": "Was a little low cut for me though, felt like it was a little showey for me.", "review_summary": "Got a ton of compliments!  ", "review_date": "June 30, 2015", "id": 72471},
{"review_text": "Unfortunately, this was too formal so I never wore it to the wedding. It was gorgeous on and perfect fit. The dress is a little long, but with heels you'd be fine. Everything about it was amazing! I'm so upset it was too formal for this wedding I had! ", "review_summary": "The colors of this dress are absolutely amazing! ", "review_date": "October 11, 2016", "id": 82212},
{"review_text": "I had to send this back in my unlimited shipment...camel toe galore. Top half was gorgeous, though!", "review_summary": "Not long enough in the torso", "review_date": "April 20, 2016", "id": 102758}]
